GPTNeoConfig {
  "_name_or_path": "EleutherAI/gpt-neo-125m",
  "activation_function": "gelu_new",
  "architectures": [
    "GPTNeoForCausalLM"
  ],
  "attention_dropout": 0,
  "attention_layers": [
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local",
    "global",
    "local"
  ],
  "attention_types": [
    [
      [
        "global",
        "local"
      ],
      6
    ]
  ],
  "bos_token_id": 50256,
  "classifier_dropout": 0.1,
  "embed_dropout": 0,
  "eos_token_id": 50256,
  "gradient_checkpointing": false,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": null,
  "layer_norm_epsilon": 1e-05,
  "max_position_embeddings": 2048,
  "model_type": "gpt_neo",
  "num_heads": 12,
  "num_layers": 12,
  "resid_dropout": 0,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "transformers_version": "4.42.3",
  "use_cache": true,
  "vocab_size": 50257,
  "window_size": 256
}

=== Model Summary ===
===========================================================================================================================================================
Layer (type:depth-idx)                                  Input Shape               Output Shape              Param #                   Trainable
===========================================================================================================================================================
GPTNeoForCausalLM                                       --                        [1, 12, 6, 64]            --                        True
├─GPTNeoModel: 1-1                                      [1, 6]                    [1, 12, 6, 64]            --                        True
│    └─Embedding: 2-1                                   [1, 6]                    [1, 6, 768]               38,597,376                True
│    └─Embedding: 2-2                                   [1, 6]                    [1, 6, 768]               1,572,864                 True
│    └─Dropout: 2-3                                     [1, 6, 768]               [1, 6, 768]               --                        --
│    └─ModuleList: 2-4                                  --                        --                        --                        True
│    │    └─GPTNeoBlock: 3-1                            [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-1                         [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-2                   [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-1          [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-1                  [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-2                  [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-3                  [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-4                 [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-5                  [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-6                 [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-3                         [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-4                         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-2                       [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-3            [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-4                       [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-5                      [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-2                            [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-5                         [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-6                   [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-6          [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-7                  [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-8                  [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-9                  [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-10                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-11                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-12                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-7                         [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-8                         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-7                       [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-8            [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-9                       [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-10                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-3                            [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-9                         [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-10                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-11         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-13                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-14                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-15                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-16                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-17                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-18                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-11                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-12                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-12                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-13           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-14                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-15                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-4                            [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-13                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-14                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-16         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-19                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-20                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-21                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-22                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-23                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-24                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-15                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-16                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-17                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-18           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-19                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-20                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-5                            [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-17                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-18                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-21         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-25                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-26                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-27                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-28                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-29                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-30                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-19                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-20                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-22                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-23           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-24                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-25                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-6                            [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-21                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-22                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-26         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-31                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-32                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-33                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-34                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-35                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-36                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-23                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-24                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-27                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-28           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-29                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-30                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-7                            [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-25                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-26                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-31         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-37                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-38                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-39                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-40                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-41                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-42                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-27                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-28                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-32                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-33           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-34                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-35                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-8                            [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-29                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-30                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-36         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-43                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-44                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-45                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-46                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-47                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-48                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-31                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-32                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-37                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-38           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-39                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-40                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-9                            [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-33                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-34                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-41         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-49                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-50                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-51                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-52                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-53                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-54                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-35                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-36                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-42                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-43           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-44                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-45                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-10                           [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-37                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-38                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-46         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-55                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-56                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-57                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-58                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-59                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-60                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-39                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-40                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-47                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-48           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-49                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-50                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-11                           [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-41                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-42                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-51         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-61                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-62                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-63                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-64                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-65                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-66                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-43                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-44                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-52                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-53           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-54                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-55                     [1, 6, 768]               [1, 6, 768]               --                        --
│    │    └─GPTNeoBlock: 3-12                           [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    └─LayerNorm: 4-45                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoAttention: 4-46                  [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─GPTNeoSelfAttention: 5-56         [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    │    └─Linear: 6-67                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-68                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Linear: 6-69                 [1, 6, 768]               [1, 6, 768]               589,824                   True
│    │    │    │    │    └─Dropout: 6-70                [1, 12, 6, 6]             [1, 12, 6, 6]             --                        --
│    │    │    │    │    └─Linear: 6-71                 [1, 6, 768]               [1, 6, 768]               590,592                   True
│    │    │    │    │    └─Dropout: 6-72                [1, 6, 768]               [1, 6, 768]               --                        --
│    │    │    └─LayerNorm: 4-47                        [1, 6, 768]               [1, 6, 768]               1,536                     True
│    │    │    └─GPTNeoMLP: 4-48                        [1, 6, 768]               [1, 6, 768]               --                        True
│    │    │    │    └─Linear: 5-57                      [1, 6, 768]               [1, 6, 3072]              2,362,368                 True
│    │    │    │    └─NewGELUActivation: 5-58           [1, 6, 3072]              [1, 6, 3072]              --                        --
│    │    │    │    └─Linear: 5-59                      [1, 6, 3072]              [1, 6, 768]               2,360,064                 True
│    │    │    │    └─Dropout: 5-60                     [1, 6, 768]               [1, 6, 768]               --                        --
│    └─LayerNorm: 2-5                                   [1, 6, 768]               [1, 6, 768]               1,536                     True
├─Linear: 1-2                                           [1, 6, 768]               [1, 6, 50257]             38,597,376                True
===========================================================================================================================================================
